app/controllers/rands_controller.rb

  def index
    @rands = Rand.all
---
SELECT "rands".* FROM "rands"

  def show
    @rand = Rand.find(params[:id])
---
SELECT "rands".* FROM "rands" WHERE "rands"."id" = ? LIMIT 1  [["id", "1"]]

  def rand_show
    @rand_all = Rand.all
    rand_num=rand(@rand_all.size)+1
    @rand = Rand.find(rand_num)
---
SELECT "rands".* FROM "rands"
SELECT "rands".* FROM "rands" WHERE "rands"."id" = ? LIMIT 1  [["id", 2]]

  def edit
    @rand = Rand.find(params[:id])
---
SELECT "rands".* FROM "rands" WHERE "rands"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @rand = Rand.new(params[:rand])

    respond_to do |format|
      if @rand.save
---
INSERT INTO "rands" ("created_at", "file", "file_desc", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 05 Nov 2012 15:41:28 UTC +00:00], ["file", "girl_00001.png"], ["file_desc", "オールスパイス"], ["updated_at", Mon, 05 Nov 2012 15:41:28 UTC +00:00]]

  def update
    @rand = Rand.find(params[:id])

    respond_to do |format|
      if @rand.update_attributes(params[:rand])
---
SELECT "rands".* FROM "rands" WHERE "rands"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "rands" SET "file" = 'img_girl_0001.jpg', "updated_at" = '2012-11-12 15:49:33.178659' WHERE "rands"."id" = 1